{
    "architectures": [
        "GPTFromScratchModel"
    ],
    "model_type": "gpt_from_scratch",

    "vocab_size": 50257,
    "embed_size": 768,
    "block_size": 128,
    "num_heads": 12,
    "num_layers": 12,
    "dropout": 0.1,

    "bos_token_id": 50256,
    "eos_token_id": 50256
}